//
//  SkillPickerView.swift
//  guraburucalc
//
//  Created by Ryuichi Takayama on 2019/02/24.
//  Copyright © 2019 takayamashi. All rights reserved.
//

import Foundation

class SkillPickerArray{
    func returnSkillArray() -> [String]{
        let array = ["通常攻刃(小)", "通常攻刃(中)", "通常攻刃(大)", "通常攻刃Ⅱ", "通常攻刃Ⅲ", "マグナ攻刃",
                     "マグナ攻刃Ⅱ", "EX攻刃(小)", "EX攻刃(中)", "EX攻刃(大)", "EX攻刃(特大)", "通常守護(小)",
                     "通常守護(中)", "通常守護(大)", "通常守護Ⅱ", "マグナ守護(小)", "マグナ守護(中)", "マグナ守護(大)",
                     "マグナ守護Ⅱ", "通常神威(小)", "通常神威(中)", "マグナ神威", "マグナ神威Ⅱ", "通常背水(小)",
                     "通常背水(中)", "通常背水(大)", "マグナ背水(小)", "マグナ背水(中)", "マグナ背水(大)",
                     "通常渾身(大)", "通常渾身(中)", "マグナ渾身(小)", "マグナ渾身(中)", "通常二手(小)", "通常二手(中)",
                     "通常二手(大)", "通常三手(小)", "通常三手(中)", "通常三手(大)",
                     "マグナ二手(小)", "マグナ二手(中)", "マグナ二手(大)", "マグナ三手(小)", "マグナ三手(中)",
                     "マグナ三手(大)", "マグナ破壊", "通常技巧(小)", "通常技巧(中)", "通常技巧(大)", "マグナ技巧(大)", "通常暴君",
                     "通常暴君Ⅱ", "マグナ暴君", "マグナ暴君Ⅱ", "通常無双", "通常無双Ⅱ", "マグナ無双", "通常乱舞",
                         "通常克己", "通常刹那(小)", "通常刹那(中)", "マグナ刹那(中)", "マグナ軍神", "バハ攻撃", "バハ攻撃/HP", "バハHP", "バハDATA", "オメガ基礎", "コスモス", "天司Ⅱ", "オメガ闘争"]
        return array
    }
    
    func returnSLvArray() -> [String]{
        var array = [String]()
        for i in 1..<21{
            array.append("\(i)")
        }
        
        return array
    }
}

